insert into book
values (1, 1928, 'Мастер и Маргарита'),
       (2, 1865, 'Преступление и наказание'),
       (3, 1880, 'Маленький принц'),
       (4, 1925, 'Собачье сердце'),
       (5, 1923, 'Белая гвардия'),
       (6, 1925, 'Зойкина квартира'),
       (7, 1867, 'Идиот'),
       (8, 1997, 'Гарри Поттер и философский камень'),
       (9, 2003, 'Гарри Поттер и орден феникса'),
       (10, 2007, 'Гарри Поттер и дары смерти'),
       (11, 1999, 'Гарри Поттер и узник Азкабана');

insert into author
values (1, '1891-05-15', 'Михаил', 'Булгаков'),
       (2, '1821-11-11', 'Фёдор', 'Достоевский'),
       (3, '1900-06-29', 'Антуан', 'Сент-Экзюпери'),
       (4, '1965-07-31', 'Джоан', 'Роулинг');

insert into book_author
values (1, 1),
       (2, 2),
       (3, 3),
       (4, 1),
       (5, 1),
       (6, 1),
       (7, 2),
       (8, 4),
       (9, 4),
       (10, 4),
       (11, 4);

insert into client
values (1, '2001-05-14', 'Иван', 'MALE', 'Иванов', '+78005553535'),
       (2, '2004-07-16', 'Анна', 'FEMALE', 'Иоановна', '89225553535'),
       (3, '1990-01-12', 'Катя', 'FEMALE', 'Романова', '8 (800) 777-35-35'),
       (4, '1982-12-29', 'Вася', 'MALE', 'Пупкин', null);

insert into operation
values (1, '2024-01-01', 'TAKE', 1, 2),
       (2, '2024-01-15', 'RETURN', 1, 2),
       (3, '2024-09-23', 'TAKE', 2, 1),
       (4, '2024-10-15', 'RETURN', 2, 1),
       (5, '2024-01-15', 'TAKE', 6, 2),
       (6, '2024-02-02', 'RETURN', 6, 2),
       (7, '2024-02-18', 'TAKE', 9, 2),
       (8, '2024-03-22', 'RETURN', 9, 2),
       (9, '2024-05-01', 'TAKE', 3, 3),
       (10, '2024-05-09', 'RETURN', 3, 3),
       (11, '2024-11-01', 'TAKE', 4, 1),
       (12, '2024-07-07', 'TAKE', 1, 4),
       (13, '2024-07-07', 'TAKE', 7, 4),
       (14, '2024-08-01', 'TAKE', 11, 3);


